zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32f0xx/drivers/include/stm32f0xx_ll_bus.h
/**
  * @brief  Enable APB1 peripherals clock (available in register 2).
  * @rmtoll APB2ENR      SYSCFGEN      LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      ADC1EN        LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      USART8EN      LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      USART7EN      LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      USART6EN      LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      TIM1EN        LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      SPI1EN        LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      USART1EN      LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      TIM15EN       LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      TIM16EN       LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      TIM17EN       LL_APB1_GRP2_EnableClock\n
  *         APB2ENR      DBGMCUEN      LL_APB1_GRP2_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART8 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART7 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17
  *         @arg @ref LL_APB1_GRP2_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void LL_APB1_GRP2_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB2ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB2ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not (available in register 2).
  * @rmtoll APB2ENR      SYSCFGEN      LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      ADC1EN        LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      USART8EN      LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      USART7EN      LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      USART6EN      LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      TIM1EN        LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      SPI1EN        LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      USART1EN      LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      TIM15EN       LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      TIM16EN       LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      TIM17EN       LL_APB1_GRP2_IsEnabledClock\n
  *         APB2ENR      DBGMCUEN      LL_APB1_GRP2_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART8 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART7 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17
  *         @arg @ref LL_APB1_GRP2_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
*/
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClock(uint32_t Periphs)
{
  return (READ_BIT(RCC->APB2ENR, Periphs) == Periphs);
}

/**
  * @brief  Disable APB1 peripherals clock (available in register 2).
  * @rmtoll APB2ENR      SYSCFGEN      LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      ADC1EN        LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      USART8EN      LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      USART7EN      LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      USART6EN      LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      TIM1EN        LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      SPI1EN        LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      USART1EN      LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      TIM15EN       LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      TIM16EN       LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      TIM17EN       LL_APB1_GRP2_DisableClock\n
  *         APB2ENR      DBGMCUEN      LL_APB1_GRP2_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART8 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART7 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17
  *         @arg @ref LL_APB1_GRP2_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void LL_APB1_GRP2_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2ENR, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset (available in register 2).
  * @rmtoll APB2RSTR     SYSCFGRST     LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     ADC1RST       LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     USART8RST     LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     USART7RST     LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     USART6RST     LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     TIM1RST       LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     SPI1RST       LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     USART1RST     LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     TIM15RST      LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     TIM16RST      LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     TIM17RST      LL_APB1_GRP2_ForceReset\n
  *         APB2RSTR     DBGMCURST     LL_APB1_GRP2_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART8 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART7 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17
  *         @arg @ref LL_APB1_GRP2_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void LL_APB1_GRP2_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @brief  Release APB1 peripherals reset (available in register 2).
  * @rmtoll APB2RSTR     SYSCFGRST     LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     ADC1RST       LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     USART8RST     LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     USART7RST     LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     USART6RST     LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     TIM1RST       LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     SPI1RST       LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     USART1RST     LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     TIM15RST      LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     TIM16RST      LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     TIM17RST      LL_APB1_GRP2_ReleaseReset\n
  *         APB2RSTR     DBGMCURST     LL_APB1_GRP2_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART8 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART7 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17
  *         @arg @ref LL_APB1_GRP2_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
__STATIC_INLINE void LL_APB1_GRP2_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F0xx_LL_BUS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
